gustavowd/FreePMU/STM32F769_EWizard/Src/main.c
/*******************************************************************************
* FUNCTION:
*   Update
*
* DESCRIPTION:
*   The function Update performs the screen update of the dirty area.
*
* ARGUMENTS:
*   aViewPort    - Viewport used for the screen update.
*   aApplication - Root object used for the screen update.
*
* RETURN VALUE:
*   None
*
*******************************************************************************/
static void Update( XViewport* aViewport, CoreRoot aApplication )
{
  XBitmap*       bitmap     = EwBeginUpdate( aViewport );
  GraphicsCanvas canvas     = EwNewObject( GraphicsCanvas, 0 );
  XRect          updateRect = {{ 0, 0 }, { 0, 0 }};

  /* let's redraw the dirty area of the screen. Cover the returned bitmap
     objects within a canvas, so Mosaic can draw to it. */
  if ( bitmap && canvas )
  {
    GraphicsCanvas__AttachBitmap( canvas, (XUInt32)bitmap );
    updateRect = CoreRoot__UpdateGE20( aApplication, canvas );
    GraphicsCanvas__DetachBitmap( canvas );
  }

  /* complete the update */
  if ( bitmap )
    EwEndUpdate( aViewport, updateRect );

  /* check if there is a dirty area so that the screen should be updated */
  if (( updateRect.Point2.X - updateRect.Point1.X <= 0 ) || ( updateRect.Point2.Y - updateRect.Point1.Y <= 0 ))
    return;

  /* start the update of the LCD via DSI */
  EwBspUpdateDisplay();
}

/* USER CODE END 0 */
/* Exported constants --------------------------------------------------------*/
#define FILEMGR_LIST_DEPDTH                     20
#define FILEMGR_FILE_NAME_SIZE                  64
#define FILEMGR_MAX_LEVEL                        3
#define FILEMGR_MAX_EXT_SIZE                     3

#define FILETYPE_DIR                             0
#define FILETYPE_FILE                            1

#define NUM_DISK_UNITS                           1
#define USB_DISK_UNIT                            0
/* Exported types ------------------------------------------------------------*/
typedef enum
{
USBDISK_DISCONNECTION_EVENT = 1,
USBDISK_CONNECTION_EVENT,
}
STORAGE_EventTypeDef;

typedef struct _FILELIST_LineTypeDef
{
uint8_t               type;
uint8_t               name[FILEMGR_FILE_NAME_SIZE];

}
FILELIST_LineTypeDef;

typedef struct _FILELIST_FileTypeDef
{
FILELIST_LineTypeDef  file[FILEMGR_LIST_DEPDTH] ;
uint16_t              ptr;
}
FILELIST_FileTypeDef;


/* Private defines -----------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
FATFS USBDISK_FatFs;         /* File system object for USB disk logical drive */
char USBDISK_Drive[4];       /* USB Host logical drive number */
USBH_HandleTypeDef  hUSB_Host;
osMessageQId StorageEvent;
DIR dir;

static uint32_t StorageStatus[NUM_DISK_UNITS];

/**
  * @brief  Storage Thread
  * @param  argument: pointer that is passed to the thread function as start argument.
  * @retval None
  */
static void StorageThread(void const * argument)
{
  osEvent event;

  for( ;; )
  {
    event = osMessageGet( StorageEvent, osWaitForever );

    if( event.status == osEventMessage )
    {
      switch(event.value.v)
      {
      case USBDISK_CONNECTION_EVENT:
        f_mount(&USBDISK_FatFs,USBDISK_Drive,  0);
        StorageStatus[USB_DISK_UNIT] = 1;
        break;

      case USBDISK_DISCONNECTION_EVENT:
        f_mount(0, USBDISK_Drive, 0);
        StorageStatus[USB_DISK_UNIT] = 0;
        break;
      }
    }
  }
}

/**
  * @brief  User Process
  * @param  phost: Host handle
  * @param  id:    Host Library user message ID
  * @retval None
  */
static void USBH_UserProcess  (USBH_HandleTypeDef *phost, uint8_t id)
{
  switch (id)
  {
  case HOST_USER_SELECT_CONFIGURATION:
    break;

  case HOST_USER_DISCONNECTION:
    osMessagePut ( StorageEvent, USBDISK_DISCONNECTION_EVENT, 0);
    break;

  case HOST_USER_CLASS_ACTIVE:
    osMessagePut ( StorageEvent, USBDISK_CONNECTION_EVENT, 0);
    break;
  }
}

void pendrive(void){
	  /* Link the USB Host disk I/O driver */
	  FATFS_LinkDriver(&USBH_Driver, USBDISK_Drive);

	  /* Init Host Library */
	  USBH_Init(&hUSB_Host, USBH_UserProcess, 0);

	    /* Create USB background task */
	  osThreadDef(STORAGE_Thread, StorageThread, osPriorityLow, 0, 1024);
	  osThreadCreate (osThread(STORAGE_Thread), NULL);

	  /* Create Storage Message Queue */
	  osMessageQDef(osqueue, 10, uint16_t);
	  StorageEvent = osMessageCreate (osMessageQ(osqueue), NULL);

	  /* Add Supported Class */
	  USBH_RegisterClass(&hUSB_Host, USBH_MSC_CLASS);

	  /* Start Host Process */
	  USBH_Start(&hUSB_Host);
}


int main(void)
{

  /* USER CODE BEGIN 1 */
	  /* initalize system */
	  EwBspConfigSystem();

	  /* configure system tick counter */
	  EwBspConfigSystemTick();

	  /* configure realtime clock */
	  EwBspConfigRealTimeClock();

	  /* initialize serial interface for debugging and connect xprintf module */
	  EwBspConfigSerial();
	  xdev_out( EwBspPutCharacter );

		/********* Inicialização dos Periféricos *********/
	    MX_GPIO_Init();
		//MX_USART1_UART_Init();
		MX_ADCalibration_Init();
		MX_DMA_Init();
		#ifdef PPS_30_HZ
		MX_TIM1_Init();
		#else
		MX_TIM1_Init();
		MX_TIM8_Init();
		#endif
		RNG_Init();
		BSP_LED_Init(LED1);
		BSP_LED_Init(LED2);
		BSP_LED_Toggle(LED1);

		/* Cria tarefa do DHCP */
		osThreadDef(dhcpTask, DHCP_Thread, osPriorityHigh, 0, 2048);
		dhcpThread_Id = osThreadCreate (osThread(dhcpTask), NULL);

		/* Cria tarefa do GPS */
		osThreadDef(gpsTask, GPS_Task, osPriorityHigh, 0, 2048);
		gpsThread_Id = osThreadCreate (osThread(gpsTask), NULL);

		/* Cria tarefa de estima��o fasorial */
		osThreadDef(pmuTask, PMU_Task, osPriorityRealtime, 0, 2048);
		pmuThread_Id = osThreadCreate (osThread(pmuTask), NULL);

	#if EW_USE_FREE_RTOS == 1

	  /* create thread that drives the Embedded Wizard GUI application... */
	  //EwPrint( "Create UI thread...                          " );
	  osThreadDef( EmWiThreadHandle, EmWiMainLoop, osPriorityBelowNormal, 0, semtstSTACK_SIZE );
	  osThreadCreate( osThread( EmWiThreadHandle ), (void*)0 );
	  //EwPrint( "[OK]\n\r" );

	  /* ...and start scheduler */
	  osKernelStart();

	#else

