gustavowd/FreePMU/STM32F769_EWizard/Src/main.c
  }
	HAL_ADC_Stop(&hadc1);
	HAL_ADC_DeInit(&hadc1);
	DR1 = DR1 >> MEDIA_CALIB_POWER2;


}


#ifdef PPS_30_HZ


/*TIM1 Init Function*/
static void MX_TIM1_Init(void){

  TIM_ClockConfigTypeDef sClockSourceConfig;
  TIM_SlaveConfigTypeDef sSlaveConfig;
  TIM_MasterConfigTypeDef sMasterConfig;

  htim1.Instance = TIM1;
  htim1.Init.Prescaler = 0;
  htim1.Init.CounterMode = TIM_COUNTERMODE_UP;
  #if (NOMINAL_FREQ == 60)
  #if (OVERSAMPLING  == 1)
  htim1.Init.Period = 1708; //60 Hz - //1708 - 8x; //3417 - 4x;//13671 - 1x;
  #else
  htim1.Init.Period = 13671; //60 Hz - //1708 - 8x; //3417 - 4x;//13671 - 1x;
  #endif
  #endif
  #if (NOMINAL_FREQ == 50)
  #if (OVERSAMPLING  == 1)
  htim1.Init.Period = 1953; //50 Hz - //1953 - 8x; //3906 - 4x;//15625 - 1x;
  #else
  htim1.Init.Period = 15625-1;//50 Hz - //1953 - 8x; //3906 - 4x;//15625 - 1x;
  #endif
  #endif
  htim1.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  htim1.Init.RepetitionCounter = 0;
  htim1.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_ENABLE;
  if (HAL_TIM_Base_Init(&htim1) != HAL_OK){
	  _Error_Handler(__FILE__, __LINE__);
  }

  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  if (HAL_TIM_ConfigClockSource(&htim1, &sClockSourceConfig) != HAL_OK){
	  _Error_Handler(__FILE__, __LINE__);
  }

  sSlaveConfig.SlaveMode = TIM_SLAVEMODE_TRIGGER;
  sSlaveConfig.InputTrigger = TIM_TS_ETRF;
  sSlaveConfig.TriggerPolarity = TIM_TRIGGERPOLARITY_NONINVERTED;
  sSlaveConfig.TriggerPrescaler = TIM_TRIGGERPRESCALER_DIV1;
  sSlaveConfig.TriggerFilter = 0;
  if (HAL_TIM_SlaveConfigSynchronization(&htim1, &sSlaveConfig) != HAL_OK){
	  _Error_Handler(__FILE__, __LINE__);
  }

  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterOutputTrigger2 = TIM_TRGO2_UPDATE;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_ENABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&htim1, &sMasterConfig) != HAL_OK){
	  _Error_Handler(__FILE__, __LINE__);
  }
}

#else

/* Periférico        ucon  -    kit     GPS
 * TIM1_ETR          PA12       D13     PPS
 * TIM8_ETR          PA0        BT      PPS (apenas versão 1 PPS)
 * USART6-TX         PC6        D1      RX
 * USART6-RX         PC7        D0      TX
 * Enable GPS        PJ1        D2      Alimentação
 * ADC-Fase R        PA6        A0      -
 * ADC-Fase S        PA4        A1      -
 * ADC-Fase T        PF10       A3      -
 * */
/*TIM8 Init Function*/
static void MX_TIM8_Init(void)
{
  TIM_ClockConfigTypeDef sClockSourceConfig;
  TIM_SlaveConfigTypeDef sSlaveConfig;
  TIM_MasterConfigTypeDef sMasterConfig;

  htim8.Instance = TIM8;
  htim8.Init.Prescaler = 0;
  htim8.Init.CounterMode = TIM_COUNTERMODE_UP;
  #if (NOMINAL_FREQ == 60)
  #if (OVERSAMPLING  == 1)
  htim8.Init.Period = 1708; //60 Hz - //1708 - 8x; //3417 - 4x;//13671 - 1x;
  #else
  htim8.Init.Period = 13671; //60 Hz - //1708 - 8x; //3417 - 4x;//13671 - 1x;
  #endif
  #endif
  #if (NOMINAL_FREQ == 50)
  #if (OVERSAMPLING  == 1)
  htim8.Init.Period = 1953; //50 Hz - //1953 - 8x; //3906 - 4x;//15625 - 1x;
  #else
  htim8.Init.Period = 15625-1;//50 Hz - //1953 - 8x; //3906 - 4x;//15625 - 1x;
  #endif
  #endif
  htim8.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  htim8.Init.RepetitionCounter = 0;
  htim8.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_ENABLE;
  if (HAL_TIM_Base_Init(&htim8) != HAL_OK)
  {
	  _Error_Handler(__FILE__, __LINE__);
  }

  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  if (HAL_TIM_ConfigClockSource(&htim8, &sClockSourceConfig) != HAL_OK)
  {
	  _Error_Handler(__FILE__, __LINE__);
  }

  sSlaveConfig.SlaveMode = TIM_SLAVEMODE_TRIGGER;
  sSlaveConfig.InputTrigger = TIM_TS_ETRF;
  sSlaveConfig.TriggerPolarity = TIM_TRIGGERPOLARITY_NONINVERTED;
  sSlaveConfig.TriggerPrescaler = TIM_TRIGGERPRESCALER_DIV1;
  sSlaveConfig.TriggerFilter = 0;
  if (HAL_TIM_SlaveConfigSynchronization(&htim8, &sSlaveConfig) != HAL_OK)
  {
	  _Error_Handler(__FILE__, __LINE__);
  }

  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterOutputTrigger2 = TIM_TRGO2_UPDATE;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_ENABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&htim8, &sMasterConfig) != HAL_OK)
  {
	  _Error_Handler(__FILE__, __LINE__);
  }

}

/* TIM1 init function */
void MX_TIM1_Init(void)
{

	  TIM_ClockConfigTypeDef sClockSourceConfig;
	  TIM_SlaveConfigTypeDef sSlaveConfig;
	  TIM_MasterConfigTypeDef sMasterConfig;

	  htim1.Instance = TIM1;
	  htim1.Init.CounterMode = TIM_COUNTERMODE_UP;
      #if (NOMINAL_FREQ == 60)
	  htim1.Init.Prescaler = 55-1;
	  htim1.Init.Period = 63636+1;
      #endif
	  #if (NOMINAL_FREQ == 50)
	  htim1.Init.Prescaler = 100-1;
	  htim1.Init.Period = 20000-1;
	  #endif
	  htim1.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
	  htim1.Init.RepetitionCounter = 0;
	  htim1.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_ENABLE;
	  if (HAL_TIM_Base_Init(&htim1) != HAL_OK)
	  {
	    _Error_Handler(__FILE__, __LINE__);
	  }

	  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
	  if (HAL_TIM_ConfigClockSource(&htim1, &sClockSourceConfig) != HAL_OK)
	  {
	    _Error_Handler(__FILE__, __LINE__);
	  }

	  sSlaveConfig.SlaveMode = TIM_SLAVEMODE_TRIGGER;
	  sSlaveConfig.InputTrigger = TIM_TS_ETRF;
	  sSlaveConfig.TriggerPolarity = TIM_TRIGGERPOLARITY_NONINVERTED;
	  sSlaveConfig.TriggerPrescaler = TIM_TRIGGERPRESCALER_DIV1;
	  sSlaveConfig.TriggerFilter = 0;
	  if (HAL_TIM_SlaveConfigSynchronization(&htim1, &sSlaveConfig) != HAL_OK)
	  {
	    _Error_Handler(__FILE__, __LINE__);
	  }

	  sMasterConfig.MasterOutputTrigger = TIM_TRGO_UPDATE;
	  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_ENABLE;
	  if (HAL_TIMEx_MasterConfigSynchronization(&htim1, &sMasterConfig) != HAL_OK)
	  {
	    _Error_Handler(__FILE__, __LINE__);
	  }

	  /* Enable the TIM Update interrupt */
	  //htim8.Instance->DIER |= 0x01;

}
#endif

void MX_USART6_UART_Init(void)
{


	  huart6.Instance = USART6;
	  huart6.Init.BaudRate = 115200;
	  huart6.Init.WordLength = UART_WORDLENGTH_8B;
	  huart6.Init.StopBits = UART_STOPBITS_1;
	  huart6.Init.Parity = UART_PARITY_NONE;
	  huart6.Init.Mode = UART_MODE_TX_RX;
	  huart6.Init.HwFlowCtl = UART_HWCONTROL_NONE;
	  huart6.Init.OverSampling = UART_OVERSAMPLING_16;
	  huart6.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;

	  if (HAL_UART_Init(&huart6) != HAL_OK)
	  {
		  _Error_Handler(__FILE__, __LINE__);
	  }

